In [11]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [12]:
gdp = pd.read_csv("excel_cleaned/GDP in Millions of Dollars_clean.csv")
unemp_rate = pd.read_csv("excel_cleaned/Unemployment rate for age 20 years or over_clean.csv")

In [13]:
gdp.head(10)

   Year Quarter          Gross domestic product (in Millions)
0  1948      Q1                                        265742
1  1948      Q2                                        272567
2  1948      Q3                                        279196
3  1948      Q4                                        280366
4  1949      Q1                                        275034
5  1949      Q2                                        271351
6  1949      Q3                                        272889
7  1949      Q4                                        270627
8  1950      Q1                                        280828
9  1950      Q2                                        290383

In [14]:
unemp_rate.head(20)

    Year Period  Value
0   1948    Q01    3.3
1   1948    Q02    3.3
2   1948    Q03    3.3
3   1948    Q04    3.4
4   1949    Q01    4.1
5   1949    Q02    5.3
6   1949    Q03    6.1
7   1949    Q04    6.4
8   1950    Q01    5.8
9   1950    Q02    5.1
10  1950    Q03    4.2
11  1950    Q04    3.8
12  1951    Q01    3.2
13  1951    Q02    2.8
14  1951    Q03    2.8
15  1951    Q04    3.0
16  1952    Q01    2.7
17  1952    Q02    2.6
18  1952    Q03    2.8
19  1952    Q04    2.4

In [15]:
unemp_rate.loc[unemp_rate.Period == "Q01", "Period"] = "Q1"
unemp_rate.loc[unemp_rate.Period == "Q02", "Period"] = "Q2"
unemp_rate.loc[unemp_rate.Period == "Q03", "Period"] = "Q3"
unemp_rate.loc[unemp_rate.Period == "Q04", "Period"] = "Q4"

In [16]:
unemp_rate.head(20)

    Year Period  Value
0   1948     Q1    3.3
1   1948     Q2    3.3
2   1948     Q3    3.3
3   1948     Q4    3.4
4   1949     Q1    4.1
5   1949     Q2    5.3
6   1949     Q3    6.1
7   1949     Q4    6.4
8   1950     Q1    5.8
9   1950     Q2    5.1
10  1950     Q3    4.2
11  1950     Q4    3.8
12  1951     Q1    3.2
13  1951     Q2    2.8
14  1951     Q3    2.8
15  1951     Q4    3.0
16  1952     Q1    2.7
17  1952     Q2    2.6
18  1952     Q3    2.8
19  1952     Q4    2.4

In [42]:
unemp_rate = unemp_rate.rename(columns = {
    "Year" : "Year",
    "Period" : "Quarter",
    "Value" : "Unemployment(%)"
})

In [43]:
unemp_rate.head(20)

    Year Quarter  unemployment(%)
0   1948      Q1              3.3
1   1948      Q2              3.3
2   1948      Q3              3.3
3   1948      Q4              3.4
4   1949      Q1              4.1
5   1949      Q2              5.3
6   1949      Q3              6.1
7   1949      Q4              6.4
8   1950      Q1              5.8
9   1950      Q2              5.1
10  1950      Q3              4.2
11  1950      Q4              3.8
12  1951      Q1              3.2
13  1951      Q2              2.8
14  1951      Q3              2.8
15  1951      Q4              3.0
16  1952      Q1              2.7
17  1952      Q2              2.6
18  1952      Q3              2.8
19  1952      Q4              2.4

In [44]:
unemp_rate.to_csv("unemployment_rate_clean.csv")
gdp.to_csv("gdp.csv")

In [45]:
GDP_and_unemp_rate = pd.merge(unemp_rate, gdp, on = "Year")

In [46]:
GDP_and_unemp_rate.head(20)

,Year,Quarter_x,unemployment(%),Quarter_y,Gross domestic product (in Millions)
0,1948,Q1,3.3,Q1,265742
1,1948,Q1,3.3,Q2,272567
2,1948,Q1,3.3,Q3,279196
3,1948,Q1,3.3,Q4,280366
4,1948,Q2,3.3,Q1,265742
5,1948,Q2,3.3,Q2,272567
6,1948,Q2,3.3,Q3,279196
7,1948,Q2,3.3,Q4,280366
8,1948,Q3,3.3,Q1,265742
9,1948,Q3,3.3,Q2,272567
10,1948,Q3,3.3,Q3,279196
11,1948,Q3,3.3,Q4,280366
12,1948,Q4,3.4,Q1,265742
13,1948,Q4,3.4,Q2,272567
14,1948,Q4,3.4,Q3,279196
15,1948,Q4,3.4,Q4,280366
16,1949,Q1,4.1,Q1,275034
17,1949,Q1,4.1,Q2,271351
18,1949,Q1,4.1,Q3,272889
19,1949,Q1,4.1,Q4,270627

In [47]:
combined = GDP_and_unemp_rate.drop(columns = ["Quarter_x"])

In [48]:
combined.head(20)

,Year,unemployment(%),Quarter_y,Gross domestic product (in Millions)
0,1948,3.3,Q1,265742
1,1948,3.3,Q2,272567
2,1948,3.3,Q3,279196
3,1948,3.3,Q4,280366
4,1948,3.3,Q1,265742
5,1948,3.3,Q2,272567
6,1948,3.3,Q3,279196
7,1948,3.3,Q4,280366
8,1948,3.3,Q1,265742
9,1948,3.3,Q2,272567
10,1948,3.3,Q3,279196
11,1948,3.3,Q4,280366
12,1948,3.4,Q1,265742
13,1948,3.4,Q2,272567
14,1948,3.4,Q3,279196
15,1948,3.4,Q4,280366
16,1949,4.1,Q1,275034
17,1949,4.1,Q2,271351
18,1949,4.1,Q3,272889
19,1949,4.1,Q4,270627